In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('E:\Data Science\Datasets\weather.csv')

In [3]:
df.head()

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,01-01-2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,02-01-2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,03-01-2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,04-01-2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,05-01-2016,20,-3,41,30.57,10,5.0,0,0,NaN,333

In [4]:
df['Temperature'].max()

50

In [5]:
df['EST'][df['Events']=='Rain']

8     09-01-2016
9     10-01-2016
15    16-01-2016
26    27-01-2016
Name: EST, dtype: object

In [6]:
df['WindSpeedMPH'].mean()

6.892857142857143

In [7]:
df[['EST','Temperature','DewPoint','Events']][df['Events']=='Rain']

           EST  Temperature  DewPoint Events
8   09-01-2016           44        38   Rain
9   10-01-2016           50        46   Rain
15  16-01-2016           47        37   Rain
26  27-01-2016           41        22   Rain

In [8]:
df.fillna(0,inplace=True)
df['WindSpeedMPH'].mean()

6.225806451612903

In [9]:
df1=pd.read_csv('E:\Data Science\Datasets\weather_data.csv')

In [10]:
df1

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [11]:
rows,columns=df1.shape

In [12]:
rows,columns

(6, 4)

In [13]:
df1[2:5]

        day  temperature  windspeed event
2  1/3/2017           28          2  Snow
3  1/4/2017           24          7  Snow
4  1/5/2017           32          4  Rain

In [14]:
df1[-3:]

        day  temperature  windspeed  event
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [15]:
df1.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [16]:
df1['temperature'] # or df1.temperature

0    32
1    35
2    28
3    24
4    32
5    31
Name: temperature, dtype: int64

In [17]:
type(df1.temperature)

pandas.core.series.Series

In [18]:
df1[['event','day','temperature']]

   event       day  temperature
0   Rain  1/1/2017           32
1  Sunny  1/2/2017           35
2   Snow  1/3/2017           28
3   Snow  1/4/2017           24
4   Rain  1/5/2017           32
5  Sunny  1/6/2017           31

In [19]:
df1['temperature'].min()

24

In [20]:
df1['temperature'].max()

35

In [21]:
df1.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.829708   2.338090
min      24.000000   2.000000
25%      28.750000   2.500000
50%      31.500000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

In [22]:
df1[df1.temperature==df1.temperature.max()]

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny

In [23]:
df1[df1['temperature']==df1['temperature'].max()]

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny

In [24]:
df1[['day','temperature']][df1['temperature']==df1['temperature'].max()]

        day  temperature
1  1/2/2017           35

In [25]:
df1.index

RangeIndex(start=0, stop=6, step=1)

In [26]:
df1

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [27]:
df1.set_index('day',inplace=True)

In [28]:
df1

          temperature  windspeed  event
day
1/1/2017           32          6   Rain
1/2/2017           35          7  Sunny
1/3/2017           28          2   Snow
1/4/2017           24          7   Snow
1/5/2017           32          4   Rain
1/6/2017           31          2  Sunny

In [29]:
df1.loc['1/3/2017']

temperature      28
windspeed         2
event          Snow
Name: 1/3/2017, dtype: object

In [30]:
df1.reset_index(inplace=True)

In [31]:
df1

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [32]:
df1.set_index('event',inplace=True)

In [33]:
df1

            day  temperature  windspeed
event
Rain   1/1/2017           32          6
Sunny  1/2/2017           35          7
Snow   1/3/2017           28          2
Snow   1/4/2017           24          7
Rain   1/5/2017           32          4
Sunny  1/6/2017           31          2

In [34]:
df1.loc['Snow']

            day  temperature  windspeed
event
Snow   1/3/2017           28          2
Snow   1/4/2017           24          7

In [35]:
df1

            day  temperature  windspeed
event
Rain   1/1/2017           32          6
Sunny  1/2/2017           35          7
Snow   1/3/2017           28          2
Snow   1/4/2017           24          7
Rain   1/5/2017           32          4
Sunny  1/6/2017           31          2

In [36]:
df2=pd.read_excel('E:\Data Science\Datasets\weather_data.xlsx','weather_data')
df2

         day  temperature  windspeed  event
0 2017-01-01           32          6   Rain
1 2017-02-01           35          7  Sunny
2 2017-03-01           28          2   Snow
3 2017-04-01           24          7   Snow
4 2017-05-01           32          4   Rain
5 2017-06-01           31          2  Sunny

In [37]:
weather_data = {
    'day': ['1/1/2017','1/2/2017','1/3/2017'],
    'temperature': [32,35,28],
    'windspeed': [6,7,2],
    'event': ['Rain', 'Sunny', 'Snow']}

In [38]:
print(type(weather_data))

<class 'dict'>

In [39]:
df3 = pd.DataFrame(weather_data)
df3

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [40]:
weather_data=[
    ('1/1/2017',32,6,'Rain'),
    ('1/2/2017',35,7,'Sunny'),
    ('1/3/2017',28,2,'Snow')
]

In [41]:
df4=pd.DataFrame(weather_data, columns=['day','temperature','windspeed','event'])
df4

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [42]:
weather_data = [
    {'day': '1/1/2017', 'temperature': 32, 'windspeed': 6, 'event': 'Rain'},
    {'day': '1/2/2017', 'temperature': 35, 'windspeed': 7, 'event': 'Sunny'},
    {'day': '1/3/2017', 'temperature': 28, 'windspeed': 2, 'event': 'Snow'},
     ]

In [43]:
df5=pd.DataFrame(weather_data)
df5

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [44]:
df6=pd.read_csv('E:\Data Science\Datasets\stock_data.csv')
df6

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [45]:
df7=pd.read_csv('E:\Data Science\Datasets\stock_data.csv',header=1) #skiprows=1 will also work
df7

  GOOGL          27.82   87   845     larry page
0   WMT           4.61  484    65           n.a.
1  MSFT             -1   85    64     bill gates
2  RIL   not available   50  1023  mukesh ambani
3  TATA            5.6   -1  n.a.     ratan tata

In [46]:
#when there's no header
df8=pd.read_csv('E:\Data Science\Datasets\stock_data.csv',header=None,names=['ticker','eps','revenue','price','people'])
df8

    ticker            eps  revenue  price         people
0  tickers            eps  revenue  price         people
1    GOOGL          27.82       87    845     larry page
2      WMT           4.61      484     65           n.a.
3     MSFT             -1       85     64     bill gates
4     RIL   not available       50   1023  mukesh ambani
5     TATA            5.6       -1   n.a.     ratan tata

In [47]:
#read only n rows
df9=pd.read_csv('E:\Data Science\Datasets\stock_data.csv',nrows=3)
df9

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates